package com.javarush.test.level02.lesson08.task01;

/**
 Написать функцию, которая вычисляет минимум из двух чисел.
 */
public class Solution {

    public static void main(String[] args) {
        int a = 3;
        int b = 7;
        System.out.print(min(a,b));
    }


    public static int min(int a, int b) {
        int min=0;
        // напишите код здесь:


        return min;
    }
}
