package com.javarush.test.level10.lesson11.home10;

/* Пять наибольших чисел
Создать список целых чисел. Ввести с клавиатуры 10 целых чисел.
Создать метод по безопасному извлечения чисел из списка:
int safeGetElement(ArrayList<Integer> list, int index, int defaultValue)
Метод должен возвращать элемент списка (list) по его индексу (index).
Если в процессе получения элемента возникло исключение, его нужно перехватить, и метод должен вернуть defaultValue.
*/

class Solution {
    // напишите код здесь:

}
