package com.javarush.test.level03.lesson04.task02;

/* Мое имя
Вывести на экран свое имя 5 строк по 10 раз (через пробел).
*/

class Solution {

    public static void main(String[] args) {

        int v; // TODO лучше объявлять в параметрах цикла: for (int i = 0; i < 5; i++) ...
        for (v = 0; v < 5; v++) {
            System.out.println("Вика Вика Вика Вика Вика Вика Вика Вика Вика Вика ");

        }

    }


}