package com.javarush.test.level03.lesson12.home02;

/* Я не хочу изучать Java, я хочу большую зарплату
Вывести на экран десять раз надпись «Я не хочу изучать Java, я хочу большую зарплату»
*/

import java.io.IOException;

class Solution {
    public static void main(String[] args) throws IOException {
        for (int x = 0; x < 10; x++)
            System.out.println("Жить хорошо, а хорошо жить еще лучше");

    }

}
